<template>
  <!--关于平台系统-->
  <div class="content">
    <p>
      平台主要服务高校的教师,学生，为他们提供更便捷的教学方法，以及更高校的学习效率。
    </p>
    <span>学生:</span>
    <ol>
      <li>作业提交:在线查看教师发布的作业,以及作业提交。</li>
      <li>成绩查看:在线查看提交作业的成绩以及教师给出的评语。</li>
      <li>课前资料下载:学生可以在教师上课之前,提前下载课件内容进行预习。</li>
      <li>密码修改:学生可以对自己的登陆密码进行修改。</li>
      <li>公共资源查询:学生可以在公共资源栏目搜寻自己感兴趣的内容。</li>
      <li>公共资源上传:学生也可以上传自己觉得有用的资源。</li>
    </ol>
    <span>教师:</span>
    <ol>
      <li>学生信息查看:教师可以查看自己负责学生,以及根据学生的姓名,学号,专业等信息进行筛选。
        还可以点击明细查看该生的详细信息。
      </li>
      <li>学生信息维护:教师可以添加，修改，删除自己负责的学生信息。</li>
      <li>学生信息导出:教师可以对需要的学生信息选择进行导出成excel,方便打印等。</li>
      <li>学生信息导入:教师可以下载平台的excel文件，进行导入学生信息。</li>
      <li>学生作业管理:教师可以填写作业的名称，作业描述，上传文件信息发布作业，默认是推送
        给该教师负责的所有学生.
      </li>
      <li>提交情况查看:教师可以查看学生的作业提交情况,对于提交作业的学生则可以进行下载批阅
      </li>
      <li>学生在线考勤:教师在上课时候可以对所负责的学生进行在线考勤。
      </li>
      <li>考勤信息查看:教师可以对每一位学生的考勤情况进行查看，便于给出平时分考核，
        默认只显示该生所有未考勤的记录。
      </li>
    </ol>
  </div>
</template>

<script>
  export default {
    name: 'AboutSystem'
  }
</script>

<style scoped>
  .content {
    font-size: large;
    line-height: 30px;
    color: black;
  }
</style>
